Enums/ТипыТекстовЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыТекстовЭлектронныхПисем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмеченныйТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTMLСКартинками</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПакетовДанныхКОбработке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыПакетовДанныхКОбработке</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаФайла</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/УчетныеЗаписиЭлектроннойПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиЭлектроннойПочты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверИсходящейПочтыSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортSMTP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортIMAP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMTPАутентификация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыSMTPАутентификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОжидания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОставлятьКопииСообщенийНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодХраненияСообщенийНаСервере</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляПолучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйРазмерПисьма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверВходящейПочтыIMAP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоЗащищеннаяАутентификацияIMAP</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РаботаСЭлектроннойПочтой/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ОтправитьПростоеЭлектронноеПисьмо(Кому, Тема, Тело, Вложения = Неопределено, знач УчетнаяЗапись = Неопределено, ОтложеннаяОтправка = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		УчетнаяЗапись = ПолучитьСистемнуюУчетнуюЗапись();
	КонецЕсли;
	
	ПараметрыПисьма = Новый Структура("Кому, Тема, Тело",
		Кому, Тема, Тело);
		
	Если ТипЗнч(Вложения) = Тип("Соответствие") Тогда
		ПараметрыПисьма.Вставить("Вложения", Вложения);
	КонецЕсли;
		
	ОтправитьЭлектронноеПисьмо(УчетнаяЗапись, ПараметрыПисьма,, ОтложеннаяОтправка);
	
КонецФункции // ОтправитьПростоеЭлектронноеПисьмо

// Функция для отправки сообщений. Проверяет корректность заполнения учетной
// записи и вызывает функцию, реализующую механику отправки.
//
// см. параметры функции ОтправитьСообщение
// 
// Примечание: параметр ПараметрыПисьма.Вложения может содержать вместо двоичных данных адреса во
//   временном хранилище, по которым хранятся эти данные.
//
Функция ОтправитьЭлектронноеПисьмо(знач УчетнаяЗапись, знач ПараметрыПисьма, знач Соединение = Неопределено, ОтложеннаяОтправка = Ложь, Организация = Неопределено) Экспорт
	
	Если ТипЗнч(УчетнаяЗапись) <> Тип("СправочникСсылка.УчетныеЗаписиЭлектроннойПочты")
	   Или Не ЗначениеЗаполнено(УчетнаяЗапись)
	Тогда
		ВызватьИсключение НСтр("ru = 'Учетная запись не заполнена или заполнена неправильно.'");
	КонецЕсли;
	
	Если ПараметрыПисьма = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не заданы параметры отправки.'");
	КонецЕсли;
	
	ТипЗнчКому        = ?(ПараметрыПисьма.Свойство("Кому"), ТипЗнч(ПараметрыПисьма.Кому), Неопределено);
	ТипЗнчКопии       = ?(ПараметрыПисьма.Свойство("Копии"), ТипЗнч(ПараметрыПисьма.Копии), Неопределено);
	ТипЗнчСлепыеКопии = ?(ПараметрыПисьма.Свойство("СлепыеКопии"), ТипЗнч(ПараметрыПисьма.СлепыеКопии), Неопределено);
	
	Если ТипЗнчКому = Неопределено И ТипЗнчКопии = Неопределено И ТипЗнчСлепыеКопии = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не указано ни одного получателя.'");
	КонецЕсли;
	
	Если ТипЗнчКому = Тип("Строка") Тогда
		ПараметрыПисьма.Кому = РаботаСоСтрокамиКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(ПараметрыПисьма.Кому);
	ИначеЕсли ТипЗнчКому <> Тип("Массив") Тогда
		ПараметрыПисьма.Вставить("Кому", Новый Массив);
	КонецЕсли;
	
	Если ТипЗнчКопии = Тип("Строка") Тогда
		ПараметрыПисьма.Копии = РаботаСоСтрокамиКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(ПараметрыПисьма.Копии);
	ИначеЕсли ТипЗнчКопии <> Тип("Массив") Тогда
		ПараметрыПисьма.Вставить("Копии", Новый Массив);
	КонецЕсли;
	
	Если ТипЗнчСлепыеКопии = Тип("Строка") Тогда
		ПараметрыПисьма.СлепыеКопии = РаботаСоСтрокамиКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(ПараметрыПисьма.СлепыеКопии);
	ИначеЕсли ТипЗнчСлепыеКопии <> Тип("Массив") Тогда
		ПараметрыПисьма.Вставить("СлепыеКопии", Новый Массив);
	КонецЕсли;
	
	Если ПараметрыПисьма.Свойство("АдресОтвета") И ТипЗнч(ПараметрыПисьма.АдресОтвета) = Тип("Строка") Тогда
		ПараметрыПисьма.АдресОтвета = РаботаСоСтрокамиКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(ПараметрыПисьма.АдресОтвета);
	КонецЕсли;
	
	Если ПараметрыПисьма.Свойство("Вложения") Тогда
		Для Каждого КлючИЗначение Из ПараметрыПисьма.Вложения Цикл
			Вложение = КлючИЗначение.Значение;
			Если ПривестиВложениеДляВставкиВПисьмо(Вложение) Тогда
				ПараметрыПисьма.Вложения.Вставить(КлючИЗначение.Ключ, Вложение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ОтправитьСообщение(УчетнаяЗапись, ПараметрыПисьма, Соединение, ОтложеннаяОтправка);
	
КонецФункции // ОтправитьЭлектронноеПисьмо

// Получает ссылку на учетную запись по виду назначения учетной записи.
// Параметры:
// ВидНазначенияУчетнойЗаписи - Перечисления.ВидыНазначенияУчетныхЗаписей -
//                 вид назначения учетной записи
// Возвращаемое значение:
// УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектроннойПочты - ссылка
//                 на описание учетной записи
//
Функция ПолучитьСистемнуюУчетнуюЗапись() Экспорт
	
	Возврат Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	
КонецФункции

// Получить доступные учетные записи электронной почты
// Параметры:
// ДляОтправки - Булево - Если установлено Истина, то будут выбирать только записи, с которых можно отправлять почту
// ДляПолучения   - Булево - Если установлено Истина, то будут выбирать только записи, по которым можно получать почту
// ВключатьСистемнуюУчетнуюЗапись - Булево - включать системную учетную запись, если доступна
//
// Возвращаемое значение:
// ДоступныеУчетныеЗаписи - ТаблицаЗначений - С колонками:
//    Ссылка       - СправочникСсылка.УчетныеЗаписиЭлектроннойПочты - Ссылка на учетную запись
//    Наименование - Строка - Наименование учетной записи
//    Адрес        - Строка - Адрес электронной почты
//
Функция ПолучитьДоступныеУчетныеЗаписи(знач ДляОтправки = Неопределено, знач ДляПолучения  = Неопределено, знач ВключатьСистемнуюУчетнуюЗапись = Истина) Экспорт
	
	Если Не ПравоДоступа("Чтение", Метаданные.Справочники.УчетныеЗаписиЭлектроннойПочты) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УчетныеЗаписиЭлектроннойПочты.Ссылка				КАК Ссылка,
		|	УчетныеЗаписиЭлектроннойПочты.Наименование			КАК Наименование,
		|	УчетныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты КАК Адрес
		|ИЗ
		|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
		|ГДЕ";
	
	Если ДляОтправки <> Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьДляОтправки = &ДляОтправки";
	КонецЕсли;
	
	Если ДляПолучения <> Неопределено Тогда
		Если ДляОтправки <> Неопределено Тогда
			ТекстЗапроса = ТекстЗапроса + "
			| И";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьДляПолучения = &ДляПолучения";
	КонецЕсли;

	Если НЕ ВключатьСистемнуюУчетнуюЗапись Тогда
		ТекстЗапроса =ТекстЗапроса + "
		|	И УчетныеЗаписиЭлектроннойПочты.Ссылка <> Значение(Справочник.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты)";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.Параметры.Вставить("ДляОтправки", ДляОтправки);
	Запрос.Параметры.Вставить("ДляПолучения", ДляПолучения);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗарегистрироватьОшибкуОтправкиПисьма(Идентификатор, Тема, Получатели, ДатаДобавления, ИнформацияОбОшибке)
	
	ПредставлениеОшибки = ?(ТипЗнч(ИнформацияОбОшибке) = Тип("ИнформацияОбОшибке"), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке), ИнформацияОбОшибке); 
	
	ТекстОшибки = СтрШаблон(
		"Ошибка отправки электронного письма.
		|Тема: %1
		|Получатели: %2
		|Дата добавления: %3
		|Идентификатор: %4
		|
		|Информация об ошибке: 
		|%5",
		Тема,
		Получатели,
		ДатаДобавления,
		Идентификатор,
		ПредставлениеОшибки);
	
	РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ТекстОшибки, "Отправка электронного письма");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьHTMLФорматированногоДокументаДляПисьма(ФорматированныйДокумент) Экспорт
	
	// Выгрузка форматированного документа в HTML текст и картинки.
	ТекстHTML = "";
	Картинки = Новый Структура;
	ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, Картинки);
	
	// Конвертация HTML текста в ДокументHTML.
	Построитель = Новый ПостроительDOM;
	ЧтениеHTML = Новый ЧтениеHTML;
	ЧтениеHTML.УстановитьСтроку(ТекстHTML);
	ДокументHTML = Построитель.Прочитать(ЧтениеHTML);
	
	// Замена имен картинок в документе HTML на идентификаторы.
	Для Каждого Картинка Из ДокументHTML.Картинки Цикл
		АтрибутИсточникКартинки = Картинка.Атрибуты.ПолучитьИменованныйЭлемент("src");
		АтрибутИсточникКартинки.ТекстовоеСодержимое = "cid:" + АтрибутИсточникКартинки.ТекстовоеСодержимое;
	КонецЦикла;
	
	// Конвертация ДокументHTML обратно в текст HTML.
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьHTML = Новый ЗаписьHTML;
	ЗаписьHTML.УстановитьСтроку();
	ЗаписьDOM.Записать(ДокументHTML, ЗаписьHTML);
	ТекстHTML = ЗаписьHTML.Закрыть();
	
	// Подготовка результата.
	Результат = Новый Структура;
	Результат.Вставить("ТекстHTML", ТекстHTML);
	Результат.Вставить("Картинки", Картинки);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтрокуПолучателей(Получатели) Экспорт
	
	МассивАдресов = Новый Массив;
	
	Для Каждого Получатель Из Получатели Цикл
		МассивАдресов.Добавить(Получатель.Адрес);	
	КонецЦикла;
	
	Возврат СтрСоединить(МассивАдресов, "; ");
	
КонецФункции

// Преобразовывает внутренние форматы вложений к двоичным данным.
//
Функция ПривестиВложениеДляВставкиВПисьмо(Вложение)
	
	Если ТипЗнч(Вложение) = Тип("Строка") И ЭтоАдресВременногоХранилища(Вложение) Тогда
		Вложение = ПолучитьИзВременногоХранилища(Вложение);
		ПривестиВложениеДляВставкиВПисьмо(Вложение);
		Возврат Истина;
	ИначеЕсли ТипЗнч(Вложение) = Тип("Картинка") Тогда
		Вложение = Вложение.ПолучитьДвоичныеДанные();
		Возврат Истина;
	ИначеЕсли ТипЗнч(Вложение) = Тип("Файл") И Вложение.Существует() И Вложение.ЭтоФайл() Тогда
		Вложение = Новый ДвоичныеДанные(Вложение.ПолноеИмя);
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Функция отправления - непосредственная реализация механики отправления
// электронного сообщения
//
// Функция, реализующая механику отправки сообщения электронной почты
//
// Параметры:
// УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектроннойПочты - ссылка на
//                 учетную запись электронной почты
// ПараметрыПисьма - структура - содержит всю необходимую информацию о письме:
//                   содержит следующие ключи:
//    Кому*      - Массив структур, строка - Интернет адрес получателя письма
//                 Адрес         - строка - почтовый адрес
//                 Представление - строка - имя адресата
//    Копии      - массив структур, строка - Интернет адреса получателей письма
//                 используется при формировании письма для поля копий
//                 в случае массива структур, формат каждой структуры:
//                 Адрес         - строка - почтовый адрес (должно быть обязательно заполнено)
//                 Представление - строка - имя адресата
//    СлепыеКопии - массив структур, строка - Интернет адреса получателей письма
//                 используется при формировании письма для поля скрытых копий
//                 в случае массива структур, формат каждой структуры:
//                 Адрес         - строка - почтовый адрес (должно быть обязательно заполнено)
//                 Представление - строка - имя адресата
//
//    Тема*      - Строка - тема почтового сообщения
//    Тело*      - тело почтового сообщения (простой текст в кодировке win-1251)
//    Важность   - ВажностьИнтернетПочтовогоСообщения
//    Вложения   - Соответствие
//                 ключ     - наименованиеВложения - строка - наименование вложения
//                 значение - ДвоичныеДанные,Структура - либо двоичные данные вложения, либо структура,
//                            содержащая следующие свойства:
//                            "ДвоичныеДанные" - ДвоичныеДанные - двоичные данные вложения
//                            "Идентификатор" - Строка - идентификатор вложения, используется для хранения картинок, отображаемых в теле письма
//
// дополнительные ключи структуры, которые могут использоваться:
//    АдресОтвета - Соответствие - см. такие же поля как и кому
//    Пароль      - Строка - пароль для доступа учетной записи
//    ИдентификаторыОснований - строка - идентификаторы оснований данного письма
//    ОбрабатыватьТексты  - Булево - необходимость обрабатывать тексты письма при отправке
//    УведомитьОДоставке  - Булево - необходимость запроса уведомления о доставке
//    УведомитьОПрочтении - Булево - необходимость запроса уведомления о прочтении
//    ТипТекста   - Строка / Перечисление.ТипыТекстовЭлектронныхПисем/ТипТекстаПочтовогоСообщения  определяет тип переданного теста
//                  допустимые значения:
//                  HTML/ТипыТекстовЭлектронныхПисем.HTML - текст почтового сообщения в формате HTML
//                  ПростойТекст/ТипыТекстовЭлектронныхПисем.ПростойТекст - простой текст почтового сообщения. Отображается "как есть" (значение по умолчанию)
//                  РазмеченныйТекст/ТипыТекстовЭлектронныхПисем.РазмеченныйТекст - текст почтового сообщения в формате Rich Text
//
//    прим.: параметры письма помеченные символом '*' являются обязательными
//           т.е. к началу работы функции считается что они уже заполнены
//Соединение - ИнтернетПочта - существующее соединение с почтовым сервером, если не указано, то соединение устанавливается в теле функции.
//
// Возвращаемое значение:
// Строка - идентификатор отправленного почтового сообщения на smtp сервере
//
// ПРИМЕЧАНИЕ: функция может вызвать исключение, которое требуется обработать
//
Функция ОтправитьСообщение(Знач УчетнаяЗапись, Знач ПараметрыПисьма, Соединение = Неопределено, ОтложеннаяОтправка = Ложь, Организация = Неопределено)
	
	ПараметрыПакетаДанных = Новый Структура;
	
	Если Организация <> Неопределено Тогда
		ПараметрыПакетаДанных.Вставить("Организация", Организация);
	КонецЕсли;
	
	ПараметрыПакетаДанных.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	
	// Получатели
	Если НЕ ПараметрыПисьма.Свойство("Кому")
		ИЛИ ТипЗнч(ПараметрыПисьма.Кому) <> Тип("Массив")
		ИЛИ ПараметрыПисьма.Кому.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		
		ПараметрыПакетаДанных.Вставить("Получатели", Новый Массив);
		
		Для Каждого Получатель Из ПараметрыПисьма.Кому Цикл
			
			НовыйПолучатель = Новый Структура;
			
			НовыйПолучатель.Вставить("Адрес",			Получатель.Адрес);
			НовыйПолучатель.Вставить("Представление",	Получатель.Представление);
			
			ПараметрыПакетаДанных.Получатели.Добавить(НовыйПолучатель);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Копии
	Если ПараметрыПисьма.Свойство("Копии") Тогда
		
		Если ТипЗнч(ПараметрыПисьма.Копии) = Тип("Массив")
			И ПараметрыПисьма.Копии.Количество() > 0 Тогда
			
			ПараметрыПакетаДанных.Вставить("ПолучателиКопии", Новый Массив);
			
			Для Каждого Получатель Из ПараметрыПисьма.Копии Цикл
				
				НовыйПолучатель = Новый Структура;
				
				НовыйПолучатель.Вставить("Адрес",			Получатель.Адрес);
				НовыйПолучатель.Вставить("Представление",	Получатель.Представление);
				
				ПараметрыПакетаДанных.ПолучателиКопии.Добавить(НовыйПолучатель);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Слепые копии
	Если ПараметрыПисьма.Свойство("СлепыеКопии") Тогда
		
		Если ТипЗнч(ПараметрыПисьма.СлепыеКопии) = Тип("Массив")
			И ПараметрыПисьма.СлепыеКопии.Количество() > 0 Тогда
			
			ПараметрыПакетаДанных.Вставить("ПолучателиСлепыхКопий", Новый Массив);
			
			Для Каждого Получатель Из ПараметрыПисьма.СлепыеКопии Цикл
				
				НовыйПолучатель = Новый Структура;
				
				НовыйПолучатель.Вставить("Адрес",			Получатель.Адрес);
				НовыйПолучатель.Вставить("Представление",	Получатель.Представление);
				
				ПараметрыПакетаДанных.ПолучателиСлепыхКопий.Добавить(НовыйПолучатель);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыПисьма.Свойство("РеквизитыОтправителя") Тогда
		ПараметрыПакетаДанных.Вставить("АдресОтправителя",			ПараметрыПисьма.РеквизитыОтправителя.АдресЭлектроннойПочты);
		ПараметрыПакетаДанных.Вставить("ПредставлениеОтправителя",	ПараметрыПисьма.РеквизитыОтправителя.ИмяПользователя);
	Иначе
		
		РеквизитыОтправителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчетнаяЗапись, "ИмяПользователя, АдресЭлектроннойПочты");
		
		ПараметрыПакетаДанных.Вставить("АдресОтправителя",			РеквизитыОтправителя.АдресЭлектроннойПочты);
		ПараметрыПакетаДанных.Вставить("ПредставлениеОтправителя",	РеквизитыОтправителя.ИмяПользователя);
		
	КонецЕсли; 
	
	Если ПараметрыПисьма.Свойство("АдресОтвета") Тогда
		
		ПараметрыПакетаДанных.Вставить("ОбратныеАдреса", Новый Массив);
		
		Для Каждого Получатель Из ПараметрыПисьма.АдресОтвета Цикл
			
			НовыйПолучатель = Новый Структура;
			
			НовыйПолучатель.Вставить("Адрес",			Получатель.Адрес);
			НовыйПолучатель.Вставить("Представление",	Получатель.Представление);
			
			ПараметрыПакетаДанных.ОбратныеАдреса.Добавить(НовыйПолучатель);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПараметрыПисьма.Свойство("УведомитьОДоставке") Тогда
		
		ПараметрыПакетаДанных.Вставить("УведомитьОДоставке",				ПараметрыПисьма.УведомитьОДоставке);
		ПараметрыПакетаДанных.Вставить("ПолучателиУведомленияОДоставке",	Новый Массив);
		
		НовыйПолучатель = Новый Структура;
		
		НовыйПолучатель.Вставить("Адрес",			ПараметрыПакетаДанных.АдресОтправителя);
		НовыйПолучатель.Вставить("Представление",	Неопределено);
		
		ПараметрыПакетаДанных.ПолучателиУведомленияОДоставке.Добавить(НовыйПолучатель);
		
	КонецЕсли;
	
	Если ПараметрыПисьма.Свойство("УведомитьОПрочтении") Тогда
		
		ПараметрыПакетаДанных.Вставить("УведомитьОПрочтении",				ПараметрыПисьма.УведомитьОПрочтении);
		ПараметрыПакетаДанных.Вставить("ПолучателиУведомленияОПрочтении",	Новый Массив);
		
		НовыйПолучатель = Новый Структура;
		
		НовыйПолучатель.Вставить("Адрес",			ПараметрыПакетаДанных.АдресОтправителя);
		НовыйПолучатель.Вставить("Представление",	ПараметрыПакетаДанных.ПредставлениеОтправителя);
		
		ПараметрыПакетаДанных.ПолучателиУведомленияОПрочтении.Добавить(НовыйПолучатель);
		
	КонецЕсли;
	
	Если ПараметрыПисьма.Свойство("Тема") Тогда
		ПараметрыПакетаДанных.Вставить("Тема", ПараметрыПисьма.Тема);
	КонецЕсли;
	
	Если ПараметрыПисьма.Свойство("Тело") Тогда
		
		Если ТипЗнч(ПараметрыПисьма.Тело) = Тип("ФорматированныйДокумент") Тогда
			
			СодержимоеПисьма = ПолучитьHTMLФорматированногоДокументаДляПисьма(ПараметрыПисьма.Тело);
			
			ПараметрыПакетаДанных.Вставить("Текст", СодержимоеПисьма.ТекстHTML);
			
			Картинки = СодержимоеПисьма.Картинки;
			
			Если Картинки.Количество() > 0 Тогда
				
				ПараметрыПакетаДанных.Вставить("Файлы", Новый Массив);
				
				Для Каждого Картинка Из Картинки Цикл
					
					ДанныеФайла = Новый Структура;
					
					ДанныеФайла.Вставить("ДвоичныеДанные",	Картинка.Значение.ПолучитьДвоичныеДанные());
					ДанныеФайла.Вставить("Имя",				Картинка.Ключ);
					ДанныеФайла.Вставить("ПривязанКТексту",	Истина);
					ДанныеФайла.Вставить("Идентификатор",	Картинка.Ключ);
					
					ПараметрыПакетаДанных.Файлы.Добавить(ДанныеФайла);
					
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			ПараметрыПакетаДанных.Вставить("Текст", ПараметрыПисьма.Тело);
		КонецЕсли;
		
		Если ПараметрыПисьма.Свойство("ТипТекста") Тогда
			
			Если ТипЗнч(ПараметрыПисьма.ТипТекста) = Тип("Строка") Тогда
				
				Если ПараметрыПисьма.ТипТекста = "HTML" Тогда
					ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
				ИначеЕсли ПараметрыПисьма.ТипТекста = "RichText" Тогда
					ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.РазмеченныйТекст;
				Иначе
					ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст;
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ПараметрыПисьма.ТипТекста) = Тип("ТипТекстаПочтовогоСообщения") Тогда
				
				Если ПараметрыПисьма.ТипТекста = ТипТекстаПочтовогоСообщения.HTML Тогда
					ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
				ИначеЕсли ПараметрыПисьма.ТипТекста = ТипТекстаПочтовогоСообщения.РазмеченныйТекст Тогда
					ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.РазмеченныйТекст;
				Иначе
					ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст;
				КонецЕсли;
				
			Иначе
				ТипТекста = ПараметрыПисьма.ТипТекста;
			КонецЕсли;
			
		Иначе
			
			Попытка
				ПервыеШестьСимволов = НРег(Лев(СокрЛ(ПараметрыПакетаДанных.Текст), 6));
			Исключение
				ПервыеШестьСимволов = "";
			КонецПопытки;
			
			Если ПервыеШестьСимволов = "<html>" Тогда
				ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
			Иначе
				ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст;
			КонецЕсли;
			
		КонецЕсли;
		
		ПараметрыПакетаДанных.Вставить("ТипТекста", ТипТекста);
		
	КонецЕсли;
	
	Если ПараметрыПисьма.Свойство("ИдентификаторыОснований") Тогда
		ПараметрыПакетаДанных.Вставить("ИдентификаторыОснований", ПараметрыПисьма.ИдентификаторыОснований);
	КонецЕсли;
	
	Если ПараметрыПисьма.Свойство("Важность") Тогда
		ПараметрыПакетаДанных.Вставить("Важность", ПараметрыПисьма.Важность);
	КонецЕсли;
	
	Если ПараметрыПисьма.Свойство("Кодировка") Тогда
		ПараметрыПакетаДанных.Вставить("Кодировка", ПараметрыПисьма.Кодировка);
	КонецЕсли;
	
	Если ПараметрыПисьма.Свойство("ОбрабатыватьТексты") Тогда
		ПараметрыПакетаДанных.Вставить("ОбрабатыватьТексты", ПараметрыПисьма.ОбрабатыватьТексты);
	КонецЕсли;
	
	Если ПараметрыПисьма.Свойство("Вложения") Тогда
		
		Если НЕ ПараметрыПакетаДанных.Свойство("Файлы") Тогда
			ПараметрыПакетаДанных.Вставить("Файлы", Новый Массив);
		КонецЕсли;
		
		Для Каждого ЭлементВложение Из ПараметрыПисьма.Вложения Цикл
			
			ДанныеФайла = Новый Структура;
			
			Вложение = ЭлементВложение.Значение;
			
			Если ТипЗнч(Вложение) = Тип("Структура") И Вложение.Свойство("ИдентификаторВерсии") Тогда
				ДанныеФайла.Вставить("ИдентификаторВерсии", Вложение.ИдентификаторВерсии);
			ИначеЕсли ТипЗнч(Вложение) = Тип("Структура") Тогда
				ДанныеФайла.Вставить("ДанныеФайла", Вложение.ДвоичныеДанные);
			Иначе
				ДанныеФайла.Вставить("ДанныеФайла", Вложение);
			КонецЕсли;
			
			ДанныеФайла.Вставить("Имя", ЭлементВложение.Ключ);
			
			ПараметрыПакетаДанных.Файлы.Добавить(ДанныеФайла);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат РаботаСПакетамиДанныхКОбработке.СоздатьПакетДанных(Перечисления.ВидыПакетовДанныхКОбработке.ЭлектронноеПисьмо, ПараметрыПакетаДанных, ОтложеннаяОтправка);
	
КонецФункции

// Функция подготавливает письмо к отправке на почтовый сервер. Если превышен максимальный размер письма, обрабатываются вложения:
// 1. файлы архивируются;
// 2. при необходимости архивы разбиваются на тома и рассылаются в нескольких письмах с модификацией темы. 
//
// Параметры:
//	Письмо - ИнтернетПочтовоеСообщение - Обрабатываемое письмо
//	МаксимальныйРазмерПисьма - Число - Максимальный размер письма в байтах, если 0 проверка не выполняется
//
// Возвращаемое значение:
//	ТаблицаЗначений - подготовленные к отправке письма с колонками Идентификатор, Письмо
//
Функция ПодготовитьПисьмоКОтправке(Письмо, МаксимальныйРазмерПисьма) Экспорт
	
	ПодготовленныеПисьма = Новый ТаблицаЗначений;
	ПодготовленныеПисьма.Колонки.Добавить("Идентификатор",	Новый ОписаниеТипов("УникальныйИдентификатор"));
	ПодготовленныеПисьма.Колонки.Добавить("Письмо",			Новый ОписаниеТипов("ИнтернетПочтовоеСообщение"));
	
	РазмерПисьма = Письмо.ПолучитьИсходныеДанные().Размер();
	
	Если МаксимальныйРазмерПисьма = 0
		ИЛИ РазмерПисьма < МаксимальныйРазмерПисьма
		ИЛИ Письмо.Вложения.Количество() = 0
	Тогда
		
		ПисьмоКОтправке = ПодготовленныеПисьма.Добавить();
		ПисьмоКОтправке.Идентификатор	= Новый УникальныйИдентификатор;
		ПисьмоКОтправке.Письмо			= Письмо;
		
	Иначе

		// Обрабатываем вложения
		
		ВоВложенииАрхив = Ложь;
		
		Если Письмо.Вложения.Количество() = 1 Тогда
			
			Если СтрЗаканчиваетсяНа(НРег(Письмо.Вложения[0].ИмяФайла), ".zip") Тогда
				
				ВоВложенииАрхив	= Истина;
				
			Иначе
				
				Файл = Новый Файл(Письмо.Вложения[0].ИмяФайла);		
				
				Если СтрЗаканчиваетсяНа(НРег(Файл.ИмяБезРасширения), ".zip") Тогда // том архива
					ВоВложенииАрхив	= Истина;
				Иначе
					ИмяАрхива = Файл.ИмяБезРасширения + ".zip";
				КонецЕсли;
				
			КонецЕсли;

		Иначе
			
			ИмяАрхива = "Архив.zip";
		
		КонецЕсли;
		
		// Архивируем файлы
		
		Если Не ВоВложенииАрхив Тогда
		
			ВременныйКаталог = КаталогВременныхФайлов() + XMLСтрока(Новый УникальныйИдентификатор) + "\";
			
			КаталогАрхива = ВременныйКаталог + XMLСтрока(Новый УникальныйИдентификатор) + "\"; // архив размещаем в отдельном каталоге для защиты от одноименных вложений
			СоздатьКаталог(КаталогАрхива);
			
			ФайлАрхива = КаталогАрхива + ИмяАрхива;
			
			ЗаписьZipФайла = Новый ЗаписьZipФайла(ФайлАрхива, , , , , , КодировкаИменФайловВZipФайле.OSEncodingWithUTF8);

			Для Каждого Вложение Из Письмо.Вложения Цикл
			
				ИсходныйФайл = ВременныйКаталог + Вложение.ИмяФайла;
				
				Вложение.Данные.Записать(ИсходныйФайл);		
				
				ЗаписьZipФайла.Добавить(ИсходныйФайл);
				
			КонецЦикла;
			
			ЗаписьZipФайла.Записать();
			
			Письмо.Вложения.Очистить();
			Письмо.Вложения.Добавить(Новый ДвоичныеДанные(ФайлАрхива), ИмяАрхива);
			
			Попытка
				УдалитьФайлы(ВременныйКаталог);
			Исключение
				ТекстОшибки = СтрШаблон(
					"Ошибка удаления временного каталога '%1' и вложенных файлов из-за ошибки:
					|%2",
					ВременныйКаталог,
					ОписаниеОшибки());
					
				РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ТекстОшибки, "Удаление временных файлов");
			КонецПопытки;
			
			РазмерПисьма = Письмо.ПолучитьИсходныеДанные().Размер();
			
		КонецЕсли;
		
		// К этому моменту во вложениях должен остаться всего один архив.
		// Если письмо с ним все равно превышает размер, разбиваем его на тома и рассылаем в несколько письмах
		
		Если РазмерПисьма >= МаксимальныйРазмерПисьма Тогда
			
			ТемаПисьма		= Письмо.Тема;
			ИмяАрхива		= Письмо.Вложения[0].ИмяФайла;
			ДанныеАрхива	= Письмо.Вложения[0].Данные;
			
			МассивЧастей = РазделитьДвоичныеДанные(ДанныеАрхива, МаксимальныйРазмерПисьма * 0.7); // т.к. base64 увеличивает размер вложения примерно на треть 
	
			ВсегоЧастей	= МассивЧастей.Количество();
			НомерЧасти	= 0;
			
			Для Каждого ЧастьАрхива Из МассивЧастей Цикл
				
				НомерЧасти = НомерЧасти + 1;
				
				НовоеПисьмо = ?(НомерЧасти = 1, Письмо, СкопироватьПисьмо(Письмо));
				
				НовоеПисьмо.Тема = СтрШаблон("%1 (%2 из %3)", ТемаПисьма, НомерЧасти, ВсегоЧастей);
				
				НовоеПисьмо.Вложения.Очистить();
				НовоеПисьмо.Вложения.Добавить(ЧастьАрхива, ИмяАрхива + Формат(НомерЧасти, "ЧЦ='3'; ЧФ='.Ч'; ЧВН=''"));
				
				ПисьмоКОтправке = ПодготовленныеПисьма.Добавить();
				ПисьмоКОтправке.Идентификатор	= Новый УникальныйИдентификатор;
				ПисьмоКОтправке.Письмо			= НовоеПисьмо;
				
			КонецЦикла;
			
		Иначе
			
			ПисьмоКОтправке = ПодготовленныеПисьма.Добавить();
			ПисьмоКОтправке.Идентификатор	= Новый УникальныйИдентификатор;
			ПисьмоКОтправке.Письмо			= Письмо;
			
		КонецЕсли;

	КонецЕсли;		
	
	Возврат ПодготовленныеПисьма; 
	
КонецФункции

Функция СкопироватьПисьмо(Письмо) Экспорт
	
	НовоеПисьмо = Новый ХранилищеЗначения(Письмо, Новый СжатиеДанных(0));	
	
	Возврат НовоеПисьмо.Получить();
	
	#Область Альтернативный_вариант_лишь_частично_копирует	
	
	//НовоеПисьмо = Новый ИнтернетПочтовоеСообщение;
	//НовоеПисьмо.УстановитьИсходныеДанные(Письмо.ПолучитьИсходныеДанные());
	//Возврат НовоеПисьмо;
	
	#КонецОбласти	
	
КонецФункции

// Функция просмотра почты - непосредственная реализация механики отправления
// электронного сообщения
//
// Функция, реализующая механику загрузки сообщений с сервера электронной почты
// для указанной учетной записи электронной почты
//
// Параметры:
// УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектроннойПочты - ссылка на
//                 учетную запись электронной почты
//
// ПараметрыЗагрузки - структура
// ключ "Колонки" - массив - массив строк названий колонок
//                  названия колонок должны соответствовать полям объекта
//                  ИнтернетПочтовоеСообщение 
// ключ "РежимТестирования" - булево - если Истина то вызов сделан в режиме тестирования
//                            учетной записи - при этом выборка писем происходит,
//                            но в возвращаемом значении они не попадают; по умолчанию
//                            режим тестирования отключен
// ключ "ПолучениеЗаголовков" - булево - если Истина то в возвращаемом наборе есть только
//                                       заголовки писем
// ЗаголовкиИдентификаторы - массив - заголовки или идентификаторы сообщений, полные
//                                    сообщения по которым требуется получить
// ПриводитьСообщенияКТипу - Булево - возвращать набор полученных почтовых сообщений
//                                    в виде таблицы значений, с простыми типами
//                                    по умолчанию Истина
//
// ключ "Пароль" - строка - пароль для доступа
//
// Возвращаемое значение:
// НаборСообщений*- таблица значений, содержит адаптированный вариант списка сообщений на сервере
//                 Колонки таблицы значений (по умолчанию):
//                 Важность, Вложения**, ДатаОтправления, ДатаПолучения, Заголовок, ИмяОтправителя,
//                 Идентификатор, Копии, Обратный адрес, Отправитель, Получатели, Размер, Тексты,
//                 Кодировка, СпособКодированияНеASCIIСимволов, Частичное
//                 заполняется если статус Истина
//
// Прим. * - в режиме тестирования не участвует в формировании возвращаемого значения
// Прим. ** - в случае, если вложениями являются другие почтовые сообщения,
//            они сами не возвращаются но возвращаются их вложения - двоичные
//            данные и их тексты в виде двоичных данных, рекурсивно
//
Функция ЗагрузитьСообщения(знач УчетнаяЗапись, знач ПараметрыЗагрузки = Неопределено, ПараметрыОтбора = Неопределено) Экспорт
	
	// Используется для проверки возможности входа на почтовый ящик
	Перем РежимТестирования;
	
	// Получать только заголовки писем
	Перем ПолучениеЗаголовков;
	
	// Приводить почтовые сообщения к простому типу;
	Перем ПриводитьСообщенияКТипу;
	
	// Заголовки или идентификаторы писем, полные сообщения по которым требуется получить
	Перем ЗаголовкиИдентификаторы;
	
	Если ПараметрыОтбора = Неопределено Тогда
		ПараметрыОтбора = Новый Структура;
		
	ИначеЕсли ПараметрыОтбора.Свойство("ДоДатыОтправления") И ПараметрыОтбора.ДоДатыОтправления = КонецДня(ПараметрыОтбора.ДоДатыОтправления) Тогда 
		//Отборы не понимают время и этот день не захватят, для удобства использования стандартного периода скинем на начало следующего дня
		ПараметрыОтбора.Вставить("ДоДатыОтправления", ПараметрыОтбора.ДоДатыОтправления + 1);
		
	КонецЕсли;

	Если ПараметрыЗагрузки = Неопределено Тогда
		ПараметрыЗагрузки = Новый Структура;
	КонецЕсли;
	
	Если ПараметрыЗагрузки.Свойство("РежимТестирования") Тогда
		РежимТестирования = ПараметрыЗагрузки.РежимТестирования;
	Иначе
		РежимТестирования = Ложь;
	КонецЕсли;
	
	Если ПараметрыЗагрузки.Свойство("ПолучениеЗаголовков") Тогда
		ПолучениеЗаголовков = ПараметрыЗагрузки.ПолучениеЗаголовков;
	Иначе
		ПолучениеЗаголовков = Ложь;
	КонецЕсли;
	
	Если ПараметрыЗагрузки.Свойство("Пароль") Тогда
		Профиль = СформироватьИнтернетПрофиль(УчетнаяЗапись, ПараметрыЗагрузки.Пароль);
	Иначе
		Профиль = СформироватьИнтернетПрофиль(УчетнаяЗапись);
	КонецЕсли;
	
	Если ПараметрыЗагрузки.Свойство("ЗаголовкиИдентификаторы") Тогда
		ЗаголовкиИдентификаторы = ПараметрыЗагрузки.ЗаголовкиИдентификаторы;
	Иначе
		ЗаголовкиИдентификаторы = Новый Массив;
	КонецЕсли;
	
	НаборСообщенийДляУдаления = Новый Массив;
	
	НаборПисем = СоздатьАдаптированноеОписаниеПисьма();
	
	Соединение = Новый ИнтернетПочта;
	Соединение.Подключиться(Профиль, ПротоколИнтернетПочты.IMAP);
	
	Если РежимТестирования ИЛИ ПолучениеЗаголовков Тогда
		
		НаборПисем = Соединение.ПолучитьЗаголовки(ПараметрыОтбора);
		
	Иначе
		НастройкиТранспорта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчетнаяЗапись, "ОставлятьКопииСообщенийНаСервере");

		Идентификаторы	= Соединение.ПолучитьИдентификаторы(ЗаголовкиИдентификаторы, ПараметрыОтбора);
		
		Если Идентификаторы.Количество() Тогда
			НаборПисем = Соединение.Выбрать(НЕ НастройкиТранспорта.ОставлятьКопииСообщенийНаСервере, Идентификаторы);
		КонецЕсли;
		
	КонецЕсли;
	
	Соединение.Отключиться();
	
	Если РежимТестирования Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ПараметрыЗагрузки.Свойство("ПриводитьСообщенияКТипу") Тогда
		ПриводитьСообщенияКТипу = ПараметрыЗагрузки.ПриводитьСообщенияКТипу;
	Иначе
		ПриводитьСообщенияКТипу = Истина;
	КонецЕсли;
	
	Если ПриводитьСообщенияКТипу Тогда
		Если ПараметрыЗагрузки.Свойство("Колонки") Тогда
			НаборСообщений = ПолучитьАдаптированныйНаборПисем(НаборПисем, ПараметрыЗагрузки.Колонки);
		Иначе
			НаборСообщений = ПолучитьАдаптированныйНаборПисем(НаборПисем);
		КонецЕсли;
	КонецЕсли;
	
	Возврат НаборСообщений;
	
КонецФункции

// Функция удаления сообщений почты
Процедура УдалитьСообщения(знач УчетнаяЗапись, МассивУдаляемыхСообщений, знач ПараметрыЗагрузки = Неопределено) Экспорт
	
	Если ПараметрыЗагрузки = Неопределено Тогда
		ПараметрыЗагрузки = Новый Структура;
	КонецЕсли;
	
	Если ПараметрыЗагрузки.Свойство("Пароль") Тогда
		Профиль = СформироватьИнтернетПрофиль(УчетнаяЗапись, ПараметрыЗагрузки.Пароль);
	Иначе
		Профиль = СформироватьИнтернетПрофиль(УчетнаяЗапись);
	КонецЕсли;
	
	Соединение = Новый ИнтернетПочта;
	
	Соединение.Подключиться(Профиль, ПротоколИнтернетПочты.IMAP);

	Соединение.УдалитьСообщения(МассивУдаляемыхСообщений);
	Соединение.ОчиститьУдаленныеСообщения();
	
	Соединение.Отключиться();
	
КонецПроцедуры

// По переданной ссылке на учетную запись формирует профиль почтового соединения
//
// Параметры
// УчетнаяЗапись - СправочникСсылка.УчетнаяЗаписьЭлектроннойПочты - 
//                 параметры профиля в виде соответствия
//
// Возвращаемое значение
// Почтовый профиль (тип ИнтернетПочтовыйПрофиль)
//
Функция СформироватьИнтернетПрофиль(знач УчетнаяЗапись, знач Пароль = Неопределено, знач ФормироватьSMTPПрофиль = Неопределено, знач ФормироватьIMAPПрофиль = Неопределено) Экспорт
	
	НастройкиСоединения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		УчетнаяЗапись,
		"Пользователь,
		|Пароль,
		|ВремяОжидания,
		|СерверИсходящейПочтыSMTP,
		|ПортSMTP,
		|SMTPАутентификация,
		|ПользовательSMTP,
		|ПарольSMTP,
		|СерверВходящейПочтыIMAP,
		|ПортIMAP,
		|ТолькоЗащищеннаяАутентификацияIMAP,
		|ИспользоватьДляОтправки,
		|ИспользоватьДляПолучения");
		
	Если ФормироватьSMTPПрофиль = Неопределено Тогда
		ФормироватьSMTPПрофиль = НастройкиСоединения.ИспользоватьДляОтправки;
	КонецЕсли;
	
	Если ФормироватьIMAPПрофиль = Неопределено Тогда
		ФормироватьIMAPПрофиль = НастройкиСоединения.ИспользоватьДляПолучения;
	КонецЕсли;
		
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.Пользователь  = НастройкиСоединения.Пользователь;
	Профиль.ВремяОжидания = НастройкиСоединения.ВремяОжидания;
	
	Если ЗначениеЗаполнено(Пароль) Тогда
		Профиль.Пароль = Пароль;
	Иначе
		Профиль.Пароль = НастройкиСоединения.Пароль;
	КонецЕсли;
	
	Если ФормироватьSMTPПрофиль Тогда
		Профиль.АдресСервераSMTP = НастройкиСоединения.СерверИсходящейПочтыSMTP;
		Профиль.ПортSMTP         = НастройкиСоединения.ПортSMTP;
		
		Если НастройкиСоединения.SMTPАутентификация = Перечисления.ВариантыSMTPАутентификации.АналогичноIMAP Тогда
			Профиль.ПользовательSMTP   = НастройкиСоединения.Пользователь;
			Профиль.ПарольSMTP         = Профиль.Пароль;
			
		ИначеЕсли НастройкиСоединения.SMTPАутентификация = Перечисления.ВариантыSMTPАутентификации.ЗадаетсяПараметрами Тогда
			Профиль.ПользовательSMTP = НастройкиСоединения.ПользовательSMTP;
			Профиль.ПарольSMTP       = НастройкиСоединения.ПарольSMTP;

		КонецЕсли;
	КонецЕсли;
	
	Если ФормироватьIMAPПрофиль Тогда
		Профиль.ПользовательIMAP 	= НастройкиСоединения.Пользователь;
		Профиль.ПарольIMAP         	= Профиль.Пароль;
		Профиль.АдресСервераIMAP 	= НастройкиСоединения.СерверВходящейПочтыIMAP;
		Профиль.ПортIMAP         	= НастройкиСоединения.ПортIMAP;
		Профиль.ТолькоЗащищеннаяАутентификацияIMAP = НастройкиСоединения.ТолькоЗащищеннаяАутентификацияIMAP;
		Профиль.ИспользоватьSSLIMAP = Истина;
	КонецЕсли;
	
	Возврат Профиль;
	
КонецФункции

// Функция записывает адаптированный набор писем по переданным колонкам.
// Значения колонок, типы которых не поддерживаются для оперирования на клиенте
// преобразуются к строковому виду.
//
Функция ПолучитьАдаптированныйНаборПисем(знач НаборПисем, знач Колонки = Неопределено)
	
	Результат = СоздатьАдаптированноеОписаниеПисьма(Колонки);
	
	Для Каждого ПочтовоеСообщение Из НаборПисем Цикл
		НоваяСтрока = Результат.Добавить();
		
		Для Каждого НаименованиеКолонки Из Колонки Цикл
			
			Значение = ПочтовоеСообщение[НаименованиеКолонки];
			
			Если ТипЗнч(Значение) = Тип("Строка") Тогда
				Значение = РаботаСоСтрокамиКлиентСервер.УдалитьНедопустимыеСимволыXML(Значение);
			КонецЕсли;
			
			Если ТипЗнч(Значение) = Тип("ИнтернетПочтовыеАдреса") Тогда
				значение_итог = "";
				Для Каждого ОчереднойАдрес  Из Значение Цикл
					значение_вр =  ОчереднойАдрес.Адрес;
					Если ЗначениеЗаполнено(ОчереднойАдрес.ОтображаемоеИмя) Тогда
						значение_вр = ОчереднойАдрес.ОтображаемоеИмя + " <" + значение_вр + ">";
					КонецЕсли;
					Если ЗначениеЗаполнено(значение_вр) Тогда
						значение_вр = значение_вр + "; "
					КонецЕсли;
					значение_итог = значение_итог + значение_вр;
				КонецЦикла;
				
				Если ЗначениеЗаполнено(значение_итог) Тогда
					значение_итог = сред(значение_итог, 1, СтрДлина(значение_итог)-2)
				КонецЕсли;
				
				значение = значение_итог;
			КонецЕсли;
			
			Если ТипЗнч(Значение) = Тип("ИнтернетПочтовыйАдрес") Тогда
				значение_вр =  Значение.Адрес;
				Если ЗначениеЗаполнено(Значение.ОтображаемоеИмя) Тогда
					значение_вр = Значение.ОтображаемоеИмя + " <" + значение_вр + ">";
				КонецЕсли;
				значение = значение_вр;
			КонецЕсли;
			
			Если ТипЗнч(Значение) = Тип("ВажностьИнтернетПочтовогоСообщения") Тогда
				значение = Строка(Значение);
			КонецЕсли;
			
			Если ТипЗнч(Значение) = Тип("СпособКодированияНеASCIIСимволовИнтернетПочтовогоСообщения") Тогда
				значение = Строка(Значение);
			КонецЕсли;
			
			Если ТипЗнч(Значение) = Тип("ИнтернетПочтовыеВложения") Тогда
				значение_соотв = Новый Соответствие;
			
				Для Каждого ОчередноеВложение Из Значение Цикл
					ИмяВложения = ОчередноеВложение.Имя;
					Если ТипЗнч(ОчередноеВложение.Данные) = Тип("ДвоичныеДанные") Тогда
						значение_соотв.Вставить(ИмяВложения, ОчередноеВложение.Данные);
					Иначе
						ЗаполнитьВложенныеВложения(значение_соотв, ИмяВложения, ОчередноеВложение.Данные);
					КонецЕсли;
				КонецЦикла;
				
				значение = значение_соотв;
			КонецЕсли;
			
			Если ТипЗнч(Значение) = Тип("ИнтернетТекстыПочтовогоСообщения") Тогда
				значение_масс = Новый Массив;
				Для Каждого ОчереднойТекст Из Значение Цикл
					значение_соотв = Новый Соответствие;
					
					значение_соотв.Вставить("Данные", ОчереднойТекст.Данные);
					значение_соотв.Вставить("Кодировка", ОчереднойТекст.Кодировка);
					значение_соотв.Вставить("Текст", РаботаСоСтрокамиКлиентСервер.УдалитьНедопустимыеСимволыXML(ОчереднойТекст.Текст));
					значение_соотв.Вставить("ТипТекста", Строка(ОчереднойТекст.ТипТекста));
					
					значение_масс.Добавить(значение_соотв);
				КонецЦикла;
				значение = значение_масс;
			КонецЕсли;
			
			НоваяСтрока[НаименованиеКолонки] = Значение;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьВложенныеВложения(Вложения, ИмяВложения, ИнтернетПочтовоеСообщение)
	
	Для Каждого ИнтернетПочтовоеВложение Из ИнтернетПочтовоеСообщение.Вложения Цикл
		ИмяВложения = ИнтернетПочтовоеВложение.Имя;
		Если ТипЗнч(ИнтернетПочтовоеВложение.Данные) = Тип("ДвоичныеДанные") Тогда
			Вложения.Вставить(ИмяВложения, ИнтернетПочтовоеВложение.Данные);
		Иначе
			ЗаполнитьВложенныеВложения(Вложения, ИмяВложения, ИнтернетПочтовоеВложение.Данные);
		КонецЕсли;
	КонецЦикла;
	
	Индекс = 0;
	
	Для Каждого ИнтернетТекстыПочтовогоСообщения Из ИнтернетПочтовоеСообщение.Тексты Цикл
		
		Если      ИнтернетТекстыПочтовогоСообщения.ТипТекста = ТипТекстаПочтовогоСообщения.HTML Тогда
			Расширение = "html";
		ИначеЕсли ИнтернетТекстыПочтовогоСообщения.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст Тогда
			Расширение = "txt";
		Иначе
			Расширение = "rtf";
		КонецЕсли;
		ИмяТекстаВложения = "";
		Пока ИмяТекстаВложения = "" Или Вложения.Получить(ИмяТекстаВложения) <> Неопределено Цикл
			Индекс = Индекс + 1;
			ИмяТекстаВложения = РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку("%1 - (%2).%3", ИмяВложения, Индекс, Расширение);
		КонецЦикла;
		Вложения.Вставить(ИмяТекстаВложения, ИнтернетТекстыПочтовогоСообщения.Данные);
	КонецЦикла;
	
КонецПроцедуры

// Функция подготавливает таблицу, в которой впоследствии будут
// храниться сообщения с почтового сервера.
// 
// Параметры
// Колонки - строка - список полей письма, через запятую, которые должны
//                    быть записаны в таблицу. Параметр меняет тип на массив.
// Возвращаемое значение
// ТаблицаЗначений - пустая таблица значений с колонками
//
Функция СоздатьАдаптированноеОписаниеПисьма(Колонки = Неопределено)
	
	Если Колонки <> Неопределено
	   И ТипЗнч(Колонки) = Тип("Строка") Тогда
		Колонки = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(Колонки, ",");
		Для Индекс = 0 По Колонки.Количество()-1 Цикл
			Колонки[Индекс] = СокрЛП(Колонки[Индекс]);
		КонецЦикла;
	КонецЕсли;
	
	МассивКолонокПоУмолчанию = Новый Массив;
	МассивКолонокПоУмолчанию.Добавить("Важность");
	МассивКолонокПоУмолчанию.Добавить("Вложения");
	МассивКолонокПоУмолчанию.Добавить("ДатаОтправления");
	МассивКолонокПоУмолчанию.Добавить("ДатаПолучения");
	МассивКолонокПоУмолчанию.Добавить("Заголовок");
	МассивКолонокПоУмолчанию.Добавить("ИмяОтправителя");
	МассивКолонокПоУмолчанию.Добавить("Идентификатор");
	МассивКолонокПоУмолчанию.Добавить("Копии");
	МассивКолонокПоУмолчанию.Добавить("ОбратныйАдрес");
	МассивКолонокПоУмолчанию.Добавить("Отправитель");
	МассивКолонокПоУмолчанию.Добавить("Получатели");
	МассивКолонокПоУмолчанию.Добавить("Размер");
	МассивКолонокПоУмолчанию.Добавить("Тема");
	МассивКолонокПоУмолчанию.Добавить("Тексты");
	МассивКолонокПоУмолчанию.Добавить("Кодировка");
	МассивКолонокПоУмолчанию.Добавить("СпособКодированияНеASCIIСимволов");
	МассивКолонокПоУмолчанию.Добавить("Частичное");
	
	Если Колонки = Неопределено Тогда
		Колонки = МассивКолонокПоУмолчанию;
	КонецЕсли;
	
	Результат = Новый ТаблицаЗначений;
	
	Для Каждого НаименованиеКолонки Из Колонки Цикл
		Результат.Колонки.Добавить(НаименованиеКолонки);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОВЕРКА УЧЕТНОЙ ЗАПИСИ

// Служебная функция используется для проверки учетной записи электронной почты.
//
Процедура ПроверитьВозможностьОтправкиИПолученияЭлектроннойПочты(УчетнаяЗапись, ПарольПараметр, СообщениеОбОшибке, ДополнительноеСообщение) Экспорт
	
	НастройкиУчетнойЗаписи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчетнаяЗапись, "ИспользоватьДляОтправки,ИспользоватьДляПолучения");
	
	СообщениеОбОшибке = "";
	ДополнительноеСообщение = "";
	
	Если НастройкиУчетнойЗаписи.ИспользоватьДляОтправки Тогда
		Попытка
			ПроверитьВозможностьОтправкиТестовогоСообщения(УчетнаяЗапись, ПарольПараметр);
		Исключение
			СообщениеОбОшибке = РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru = 'Ошибка при отправке сообщения: %1'"),
									КраткоеПредставлениеОшибки(ИнформацияОбОшибке()) );
		КонецПопытки;
		Если Не НастройкиУчетнойЗаписи.ИспользоватьДляПолучения Тогда
			ДополнительноеСообщение = Символы.ПС + НСтр("ru = '(Выполнена проверка отправки электронных сообщений.)'");
		КонецЕсли;
	КонецЕсли;
	
	Если НастройкиУчетнойЗаписи.ИспользоватьДляПолучения Тогда
		Попытка
			ПроверитьВходНаСерверВходящейЭлектроннойПочты(УчетнаяЗапись, ПарольПараметр);
		Исключение
			Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
				СообщениеОбОшибке = СообщениеОбОшибке + Символы.ПС;
			КонецЕсли;
			
			СообщениеОбОшибке = СообщениеОбОшибке
								+ РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку(
										НСтр("ru = 'Ошибка доступа к серверу входящих сообщений: %1'"),
										КраткоеПредставлениеОшибки(ИнформацияОбОшибке()) );
		КонецПопытки;
		Если Не НастройкиУчетнойЗаписи.ИспользоватьДляОтправки Тогда
			ДополнительноеСообщение = Символы.ПС + НСтр("ru = '(Выполнена проверка получения электронных сообщений.)'");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура проверяющая возможность отправления почтового сообщения через
// учетную запись
//
// Параметры
// УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектроннойПочты - учетная запись,
//                 которую необходимо проверить
//
// Возвращаемое значение
// структура 
// ключ "статус" - булево, если Истина - успешно вошли на сервер
//                 если Ложь - ошибка при входе на сервер
// ключ "СообщениеОбОшибке" - строка - если статус Ложь - содержит сообщение об ошибке
//
Процедура ПроверитьВозможностьОтправкиТестовогоСообщения(знач УчетнаяЗапись,
														знач Пароль = Неопределено)
	
	ПараметрыПисьма = Новый Структура;
	
	ПараметрыПисьма.Вставить("Тема", НСтр("ru = 'Тестовое сообщение 1С:Предприятие'"));
	ПараметрыПисьма.Вставить("Тело", НСтр("ru = 'Это сообщение отправлено подсистемой электронной почты 1С:Предприятие'"));
	ПараметрыПисьма.Вставить("Кому", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись, "АдресЭлектроннойПочты"));
	Если Пароль <> Неопределено Тогда
		ПараметрыПисьма.Вставить("Пароль", Пароль);
	КонецЕсли;
	
	Попытка
		ОтправитьЭлектронноеПисьмо(УчетнаяЗапись, ПараметрыПисьма);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Проверка учетной записи электронной почты'"), УровеньЖурналаРегистрации.Ошибка,,
			УчетнаяЗапись, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Процедура проверяющая возможность получения почтового сообщения через
// учетную запись
//
// Параметры
// УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектроннойПочты - учетная запись,
//                 которую необходимо проверить
//
// Возвращаемое значение
// структура 
// ключ "статус" - булево, если Истина - успешно вошли на сервер
//                 если Ложь - ошибка при входе на сервер
// ключ "СообщениеОбОшибке" - строка - если статус Ложь - содержит сообщение об ошибке
//
Процедура ПроверитьВходНаСерверВходящейЭлектроннойПочты(знач УчетнаяЗапись, знач Пароль = Неопределено)
	
	ПараметрыЗагрузки = Новый Структура("РежимТестирования", Истина);
	
	Если Пароль <> Неопределено Тогда
		ПараметрыЗагрузки.Вставить("Пароль", Пароль);
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ПослеДатыОтправления"	, ТекущаяДата());
	ПараметрыОтбора.Вставить("ДоДатыОтправления"	, ТекущаяДата());
	
	Попытка
		ЗагрузитьСообщения(УчетнаяЗапись, ПараметрыЗагрузки, ПараметрыОтбора);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Проверка учетной записи электронной почты'"), УровеньЖурналаРегистрации.Ошибка,,
			УчетнаяЗапись, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры
